testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000000____delay-ms_0____loss-rate-percent_0.1____clients-requests_10/3/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 36.92s, 0.27 req/s, 258.38MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.32GB (10003052540) total, 140B (140) headers (space savings 85.57%), 9.31GB (10000000000) data
UDP datagram: 428950 sent, 8213369 received
                     min         max         mean         sd        +/- sd
time for request:     36.75s      36.90s      36.84s     49.40ms    60.00%
time for connect:     4.08ms     25.66ms     14.72ms      7.26ms    60.00%
time to 1st byte:    25.28ms     28.50ms     26.83ms      1.19ms    60.00%
req/s           :       0.03        0.03        0.03        0.00    70.00%